# Identifying & Removing Duplicates using pandas

### Example:1

In [2]:
import pandas as pd

In [8]:
d1 = pd.DataFrame({
    'id':['pro1','pro2','pro3','pro4','pro5','pro6','pro5','pro6'],
    'pro_name':['c','c++','java','python','html','css','html','css'],
    'score':[89,78,91,75,82,79,82,79],
    'lab_no':[108,103,103,108,217,103,217,103]
     } , index = [0,1,2,3,4,5,6,7]
            
)
d1

     id pro_name  score  lab_no
0  pro1        c     89     108
1  pro2      c++     78     103
2  pro3     java     91     103
3  pro4   python     75     108
4  pro5     html     82     217
5  pro6      css     79     103
6  pro5     html     82     217
7  pro6      css     79     103

In [9]:
d1.shape

(8, 4)

In [12]:
#Identify duplicates records in the data

d1.duplicated().sum()

2

In [13]:
#Removing Duplicates

d1 = d1.drop_duplicates()
d1

     id pro_name  score  lab_no
0  pro1        c     89     108
1  pro2      c++     78     103
2  pro3     java     91     103
3  pro4   python     75     108
4  pro5     html     82     217
5  pro6      css     79     103

In [14]:
d1.shape

(6, 4)

## Example:2

In [17]:
d2= pd.read_csv('users.csv')
d2.head()

                        _id                  name gender      academics
0  5d60098a653a331687083238  Nivesh Singh Chauhan   male  undergraduate
1  5d610ae1653a331687083239         Gaurav Sharma   male       graduate
2  5d618359fc5fcf3bdd9a0910         Akshay Mishra   male  undergraduate
3  5d6d2bb87fa40e1417a49315        Saksham Mathur   male  undergraduate
4  5d7c994d5720533e15c3b1e9         Varun Chowhan   male  undergraduate

In [16]:
d2.shape

(118, 4)

In [18]:
d3= d2.drop(d2.index[[i for i in range(10,118,1)]])
d3

                        _id                  name  gender      academics
0  5d60098a653a331687083238  Nivesh Singh Chauhan    male  undergraduate
1  5d610ae1653a331687083239         Gaurav Sharma    male       graduate
2  5d618359fc5fcf3bdd9a0910         Akshay Mishra    male  undergraduate
3  5d6d2bb87fa40e1417a49315        Saksham Mathur    male  undergraduate
4  5d7c994d5720533e15c3b1e9         Varun Chowhan    male  undergraduate
5  5d90fc1a641ef364939fb6cc          Boshi Kaviya  female       graduate
6  5d9a2982979d5962253c2f81       Nischaya Sharma    male  undergraduate
7  5de50d768eab6401affbb135      thesocialcomment    male       graduate
8  5ded443342a8854bf6eaba9a    MAAZ AHMAD RABBANI    male  undergraduate
9  5deeef6142a8854bf6eabab9      siddharth saxena    male  undergraduate

In [19]:
d3.shape

(10, 4)

In [22]:
d4= pd.concat([d2,d3])
d4.head()

                        _id                  name gender      academics
0  5d60098a653a331687083238  Nivesh Singh Chauhan   male  undergraduate
1  5d610ae1653a331687083239         Gaurav Sharma   male       graduate
2  5d618359fc5fcf3bdd9a0910         Akshay Mishra   male  undergraduate
3  5d6d2bb87fa40e1417a49315        Saksham Mathur   male  undergraduate
4  5d7c994d5720533e15c3b1e9         Varun Chowhan   male  undergraduate

In [21]:
d4.shape

(128, 4)

In [23]:
#Identify duplicates records in the dataset d4

d4.duplicated().sum()

10

In [26]:
#Removing Duplicates

d5 = d4.drop_duplicates()
d5.head()

                        _id                  name gender      academics
0  5d60098a653a331687083238  Nivesh Singh Chauhan   male  undergraduate
1  5d610ae1653a331687083239         Gaurav Sharma   male       graduate
2  5d618359fc5fcf3bdd9a0910         Akshay Mishra   male  undergraduate
3  5d6d2bb87fa40e1417a49315        Saksham Mathur   male  undergraduate
4  5d7c994d5720533e15c3b1e9         Varun Chowhan   male  undergraduate

In [25]:
d5.shape

(118, 4)